Repository: ryannair05/Cylinder-Remade
Catalog: settings/Resources/*.lproj/CylinderSettings.strings
Languages: ar, cs, da, de, es_mx, fr, hr, it, pt, ru, sv, tr

source: Enabled
ar: تمكين
cs: Zapnuto
da: Aktiveret
de: Aktiviert
es_mx: Habilitado
fr: Activé
hr: Uključeno
it: Attivato
pt: Ativado
ru: включено
sv: Aktiverad
tr: Aktif

source: Effects
ar: مؤثرات
cs: Efekty
da: Effekter
de: Effekte
es_mx: Efectos
fr: Effets
hr: Efekti
it: Effetti
pt: Efeitos
ru: эффекты
sv: Effekter
tr: Efektler

source: Formulas
ar: الصيغ
cs: Kombinace
da: Formularer
de: Formeln
es_mx: Fórmulas
fr: Formules
hr: Formule
it: Combinazioni
ru: формулы
sv: Formler
tr: Kişiselleştir

source: Randomize
ar: عشوائي
cs: Náhodně
da: Bland
de: Zufällig
es_mx: Aleatorio
fr: Aléatoire
hr: Nasumično
it: Casuale
pt: De forma aleatória
ru: случайный порядок
sv: Slumpmässigt
tr: Rastgele

# TRANSLATION
source: Translations wanted! If you'd like to translate this tweak shoot me a tweet or an email
ar: ترجمة حسين إبراهيم عباس
cs: Přeložil Sh4rP EYE (@MrSh4rPEYE)
da: Denne tweak er oversat af Jonas Lindenskov Nielsen (@jlndk)
de: Übersetzungen gesucht! Wenn du dieses Tweak übersetzen willst, schick mir eine E-Mail oder einen Tweet.
es_mx: Traducido por Franco Rudelir (@EpicRudelir en Twitter)
fr: J'ai besoin de traducteurs, si voulez traduire le tweak, envoyez-moi un tweet ou un email
hr: Preveo Patrik Perčinić
it: Traduzione italiana di: Omega33
pt: Tradução por RubenEnriques7
ru: Переведено Леонидом (мой имейл leonid0079@gmail.com )
sv: Översatt Av Sebastian (Grodda Da Lo)
tr: Sezer Çelekoğlu tarafından Türkçeleştirildi.

source: Donate
ar: ساهم بنجاحنا
cs: Přispět
da: Donér
de: Spenden
es_mx: Donar
fr: Dons
hr: Doniraj
it: Dona qui
pt: Doar
ru: пожертвовать
sv: Donera
tr: Bağış

source: Source code
ar: شفرة المصدر
cs: Zdrojový kód
da: Bundkode
de: Quell-Code
es_mx: Código fuente
fr: Code source
hr: Izvorni kod
it: Codice sorgente
pt: Código fonte
ru: Исходник
sv: Källkod
tr: Kaynak Kodu

# R_CYLINDER
source: More effects on /r/cylinder
ar: المزيد من المؤثرات على /r/cylinder
cs: Více efektů na /r/cylinder
da: Flere effekter på /r/cylinder
de: Mehr Effekte auf /r/cylinder
es_mx: Más efectos en /r/cylinder
fr: Plus d'effets sur /r/cylinder
hr: Još efekta na /r/cylinder
it: Altri effetti in /r/cylinder
pt: Mais efeitor em /r/cylinder
ru: Больше эффектов на /r/cylinder
sv: Mer effekter på /r/cylinder
tr: Daha fazlası için /r/cylinder

# BARREL
source: Barrel (original tweak)
ar: Barrel (الأداة الأصلية)
cs: Barrel (původní tweak)
es_mx: Barrel (tweak original)
fr: Barrel (tweak original)
hr: Barrel (originalni tweak)
it: Barrel (tweak originale)
pt: Barrel (tweak original)
ru: Barrel (с него взята идея)
tr: Barrel (Orjinal Uygulama)

# RESET_EFFECTS
source: Clear
ar: حذف
cs: Vyčistit
da: Ryd
de: Zurücksetzen
es_mx: Restaurar efectos
fr: Effacer
hr: Poništi odabir
it: Cancella
pt: Limpar
ru: очистить
tr: Temizle

source: Create new formula
ar: انتاج صيغة جديدة
cs: Nová kombinace
da: Opret ny formular
de: Neue Formel erzeugen
es_mx: Crear nueva fórmula
fr: Créer une nouvelle formule
hr: Izradi novu formulu
it: Crea una nuova combinazione
pt: Criar nova formula
ru: Создать новую формулу
sv: Skapa ny formel
tr: Yeni Bir Liste Yarat

# CREATE_FORMULA_INFO
source: The new formula will have whatever effects you have enabled right now.
ar: الصيغة الجديدة ستحتوي على كل المؤثرات التي ستقوم بتفعيلها الآن.
cs: Nová kombinace bude obsahovat všechny efekty, které máte zrovna zapnuté.
da: Formularen vil indeholde de effekter du har aktivet nu.
de: Die neue Formel wird jeden Effekt beinhalten, den du jetzt aktivierst.
es_mx: La nueva fórmula será guardada con los efectos que están habilitados en este momento.
fr: La nouvelle formule aura les effets activés actuellement.
hr: Nova formula će imati efekte koji su trenutno izabrani.
it: La nuova combinazione avrà tutti gli effetti attivati in questo momento.
pt: Esta nova formula irá conter quaisquer efeitos que estejam ativos agora.
ru: В новой формуле будут все эффекты которые включены в данный момент.
sv: Den nya formeln kommer ha vilka effekter som du har valt.
tr: Yeni listede sahip olduğun bütün efektler açık olur.

source: Formula name
ar: اسم الصيغة
cs: Jméno kombinace
da: Formular Navn
de: Name der Formel
es_mx: Nombre de la fórmula
fr: Nom de la formule
hr: Ime formule
it: Nome della combinazione
pt: Nome da formula
ru: Название формулы
sv: Formel namn
tr: Listenin Adı

source: Create Formula
ar: أنتج الصيغة
cs: Vytvořit
da: Opret Formular
de: Formel erzeugen
es_mx: Crear fórmula
fr: Créer une Formule
hr: Napravi formulu
it: Crea combinazione
pt: Criar Formula
ru: Создать формулу
sv: Skapa Formel
tr: Liste Yarat

source: Cancel
ar: إلغاء
cs: Zrušit
da: Annuller
de: Abbrechen
es_mx: Cancelar
fr: Annuler
hr: Otkaži
it: Annulla
pt: Cancelar
ru: отменить
sv: Avbryt
tr: İptal

# FORMULA_ALREADY_EXISTS
source: A formula with that name already exists.
ar: هناك صيغة حالية موجودة بنفس الاسم.
cs: Kombinace s tímto jménem už existuje.
da: Der eksistere allerede en formular med dette navn.
de: Eine Formel mit diesem Namen existiert bereits.
es_mx: Ya existe una fórmula con ese nombre.
fr: Ce nom de formule existe déjà.
hr: Formula sa tim imenom već postoji
it: Lo stesso nome è stato usato per un'altra combinazione!
pt: Já existe uma formula com o mesmo nome.
ru: Уже есть формула с таким названием.
sv: En formel med det namnet finns redan.
tr: Bu isimde listen zaten bulunmakta.

source: Overwrite it
ar: استبدال
cs: Přepsat
da: Overskriv
de: Überschreiben
es_mx: Sobreescribirla
fr: Remplacer
hr: Prepiši ga
it: Sovrascrivila
pt: Substituir
ru: Переписать это?
sv: Skriva Över
tr: Üzerine Yaz

# NO_EFFECTS_ENABLED_TITLE
source: You have no effects enabled!
ar: لا يوجد لديك أي مؤثرات ممكنة!
cs: Nemáte zapnuté žádné efekty!
da: Du har ingen effekter aktiveret!
de: Du hast keine Effekte aktiviert!
es_mx: No tienes ningún efecto activado!
fr: Vous n'avez activé aucun effet!
hr: Nije izabran niti jedan efekt
it: Non hai nessun effetto attivato!
pt: Não tens nenhum efeito ativo!
ru: Вы не включили эффекты!
sv: Du har inte igång några effekter
tr: Aktif efektin bulunmamakta!

# NO_EFFECTS_ENABLED_DESC
source: Go back to the effects list, enable some effects, then come back here and create a new formula.
ar: يرجى العودة لقائمة المؤثرات وتفعيل البعض منها ومن ثم العودة هنا لعمل صيغة جديدة.
cs: Vraťte se zpět do seznamu efektů, nějaké z nich zapněte a poté přijďte zpátky sem a vytvořte novou kombinaci.
da: Gå tilbage til effektlisten, aktiver nogle effekter, og kom tilbage hertil for at oprette en ny formular.
de: Gehe zurück zur Effekt-Liste, aktiviere ein paar Effekte und versuche dein Glück erneut.
es_mx: Ve a la lista de efectos, activa algunos, luego vuelva y crea una nueva fórmula.
fr: Retournez à la liste des effets, activez en, revenez ensuite créer une nouvelle formule.
hr: Vrati se na listu efekta, izaberi neke efekte, onda se vrati ovdje i napravi novu formulu.
it: Torna alla lista degli effetti, attiva qualche effetto, dopo torna qui e crea una nuova combinazione.
pt: Volta atrás até à lista de efeitos, ativa alguns efeitos, e depois volta aqui e cria uma nova formula.
ru: Вернись обратно в список эффектов и выбери несколько эффектов потом возвращайся сюда.
sv: Gå tillbaka till effekt listan och sätt igång några, sedan kom tillbaka hit och skapa en ny formula.
tr: Efekt listesine geri dön, efektleri aktif et, Sonra buradan yeni bir liste yarat.

# NO_EFFECTS_ENABLED_OK
source: Aight cool
ar: حسناً
cs: Ahá, jasný
da: Ok, cool
de: Ok, alles klar...
es_mx: Listo
fr: Pas cool
it: Ok!
pt: Ok, Boa
ru: Ок
sv: Det är lungt
tr: Tamamlandı

source: Thank you
ar: شكراً لك
cs: Děkuji Vám
da: Mange tak
de: Danke
es_mx: Gracias
fr: Merci
hr: Hvala ti!
it: Grazie
pt: Obrigado
ru: Спасибо
sv: Tack så mycket
tr: Teşekkürler

# PAYPAL
source: Tap here to go to Safari and donate via PayPal
ar: اضغط هنا ليتم تشغيل متصفح سفاري ليتم التبرع عبر PayPal
cs: Klikněte zde pro přechod do Safari, kde budete moci přispět přes PayPal
da: Tryk her for at åbne PayPal i Safari
de: Hier tippen um Safari zu öffnen und via PayPal zu spenden.
es_mx: Presiona aquí para ir a Safari y donar via PayPal
fr: Tapez ici pour aller sur Safari et faire un don via PayPal
hr: Dodirnite ovdje da biste otišli u Safari i donirali putem PayPal-a
it: Clicca qui per donare con PayPal tramite Safari
pt: Pressiona aqui para ir para o Safari e doar através do Paypal.
ru: Нажмите здесь, чтобы перейти к Safari и пожертвовать через PayPal
sv: Tryck här för att gå till Safari och donera via PayPal
tr: Buraya tıkla ve Safariiye git. Paypal üzerinden Bağış yap

# FOOTER_TEXT
source: HOW TO CODE YOUR OWN EFFECTS: Open iFile (or Filza) and go to /Library/Cylinder. There you'll see a bunch of folders with people's usernames. In these folders you'll see a bunch of .lua files. If you open any of these with the text viewer you can see the code. For a start I'd recommend looking at the Backwards.lua file in the gertab folder to get an idea of how to do it. In there if you edit the 2*offset to 3*offset (don't forget to reload the effect after) you'll notice a kind of "Backwards hella far" effect. Follow the pattern you see in order to add your own effects. If you get stuck, take a look at EXAMPLE.lua or search "lua tutorial" on YouTube.
de: WIE ERSTELLT MAN EFFEKTE: Öffne iFile (oder Filza) und gehe zu /Library/Cylinder. Dort siehst du eine Menge Ordner, die mit Usernames benannt sind. In diesen Ordnern befinden sich ein paar .lua-Dateien. Öffne irgendeine mit dem Text-Editor und du wirst den Code sehen. Für den Anfang empfehle ich die Backwards.lua Datei im gertab-Ordner anzuschauen, um eine Idee davon zu bekommen wie es funktioniert. Wenn du in der Datei den 2*offset zu 3*offset änderst, (Vergiss nicht den Effekt anschließend neu zu laden!) wirst du eine Art von "versetztem Backwards" - Effekt bemerken. Folge dieser Vorgehensweise um eigene Effekte zu erstellen. Wenn du Probleme bekommst, schau dir die EXAMPLE.lua Datei oder ein Tutorial auf YouTube an.
hr: KAKO KODIRATI SVOJE EFEKTE: Otvorite iFile (ili Filza) i idite na / Library / Cylinder. Tamo ćete vidjeti hrpu mapa s korisničkim imenima ljudi. U tim mapama vidjet ćete hrpu .lua datoteka. Ako otvorite bilo koji od ovih pomoću preglednika teksta, možete vidjeti kod. Za početak bih preporučio da pogledate datoteku Backwards.lua u mapi gertab kako biste dobili ideju kako se kodiraju efekti. Tamo, ako uredite 2*offset na 3*offset * (ne zaboravite ponovo učitati efekt), primijetit ćete da ste napravili novi efekt. Izmjenjujte kod u drugim datotekama kako biste dodali vlastite efekte ili napišite svoj ispočetka. Ako zapnete, pogledajte EXAMPLE.lua ili potražite "lua tutorial " na YouTubu.
pt: COMO CODIFICAR OS TEUS PROPRIOS EFEITOS: Abre o iFile (ou Filza) e vai a /Library/Cylinder. Aí verás um monte de pastas com nomes de contas. Nessas pastas vais ver um monte de ficheiros .lua. Se abrires algum desses ficheiros com o editor de texto conseguirás ver o código. Para começar recomndaria ver o ficheiro Backwards.lua na pasta gertab para ter uma ideia sobre como fazê-lo. Lá dentro, se editares o 2*offset para 3*offset (não esquecer de fazer reload aos efeitos em seguida) verás uma espécie de efeito tipo "Backwards hella far". Segue o padrão que vês para adicionar os teus próprios efeitos. Se ficares bloqueado, dá uma olhada no ficheiro EXAMPLE.lua ou pesquisa "lua tutorial" no YouTube.
